
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>介绍 · GitBook 使用教程</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Roy">
        
        
    
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-prism/prism-base16-ateliersulphurpool.light.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-advanced-emoji/emoji-website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-anchors/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-ace/ace.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-emphasize/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-mermaid-gb3/mermaid/mermaid.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-sectionx/sectionx.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-donate/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-local-video/video-js.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-anchor-navigation-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-terminal/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-alerts/style.css">
                
            
                
                <link rel="stylesheet" href="https://unpkg.com/gitalk/dist/gitalk.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    


    

        
    
    
    
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    

    
    <link rel="stylesheet" href="gitbook/gitbook-plugin-chart/c3/c3.min.css">
    <script src="gitbook/gitbook-plugin-chart/c3/d3.min.js"></script>
    <script src="gitbook/gitbook-plugin-chart/c3/c3.min.js"></script>
    

    <script src="gitbook/gitbook-plugin-graph/d3.min.js"></script>
    <script src="gitbook/gitbook-plugin-graph/function-plot.js"></script>    

    <link href="https://blog.yirenliu.cn/gitbook/rss" title="GitBook 使用教程" rel="alternate" type="application/rss+xml" />

    
        <link rel="shortcut icon" href='favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='favicon.ico' type="image/x-icon">
    
    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"RalstonLiu/gitbook","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://blog.yirenliu.cn/gitbook/" target="_blank" class="custom-link">Home</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                        <b>1.1.</b>
                    
                    介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                        <b>1.2.</b>
                    
                    文章汇总
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="哈士奇.html">
            
                <a href="哈士奇.html">
            
                    
                        <b>1.2.1.</b>
                    
                    哈士奇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="三个测温器.html">
            
                <a href="三个测温器.html">
            
                    
                        <b>1.2.2.</b>
                    
                    三个测温器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="时空传送枪.html">
            
                <a href="时空传送枪.html">
            
                    
                        <b>1.2.3.</b>
                    
                    时空传送枪
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="树莓派是什么？能吃吗？.html">
            
                <a href="树莓派是什么？能吃吗？.html">
            
                    
                        <b>1.2.4.</b>
                    
                    树莓派是什么？能吃吗？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="Sequino.html">
            
                <a href="Sequino.html">
            
                    
                        <b>1.2.5.</b>
                    
                    情人节专属时钟
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >介绍</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
<div id="vip-container">
    <h2 id="df&#x521B;&#x5BA2;&#x793E;&#x533A;&#x4ECB;&#x7ECD;"><a name="df&#x521B;&#x5BA2;&#x793E;&#x533A;&#x4ECB;&#x7ECD;" class="anchor-navigation-ex-anchor" href="#df&#x521B;&#x5BA2;&#x793E;&#x533A;&#x4ECB;&#x7ECD;"><i class="fa fa-link" aria-hidden="true"></i></a>DF&#x521B;&#x5BA2;&#x793E;&#x533A;&#x4ECB;&#x7ECD;</h2>
<h3 id="&#x3010;&#x666E;&#x901A;&#x7248;&#x3011;"><a name="&#x3010;&#x666E;&#x901A;&#x7248;&#x3011;" class="anchor-navigation-ex-anchor" href="#&#x3010;&#x666E;&#x901A;&#x7248;&#x3011;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x3010;&#x666E;&#x901A;&#x7248;&#x3011;</h3>
<p>DF&#x521B;&#x5BA2;&#x793E;&#x533A;&#x662F;&#x4E00;&#x4E2A;&#x7EBF;&#x4E0A;&#x521B;&#x5BA2;&#x5B66;&#x4E60;&#x4E0E;&#x4EA4;&#x6D41;&#x7684;&#x5E73;&#x53F0;&#xFF0C;&#x81F4;&#x529B;&#x4E8E;&#x8BA9;&#x521B;&#x5BA2;&#x548C;&#x6E34;&#x671B;&#x6210;&#x4E3A;&#x521B;&#x5BA2;&#x7684;&#x4EBA;&#x4EEC;&#x5728;&#x8FD9;&#x91CC;&#x8FDB;&#x884C;&#x4EA4;&#x6D41;&#x3001;&#x601D;&#x7EF4;&#x78B0;&#x649E;&#xFF0C;&#x4E00;&#x8D77;&#x5206;&#x4EAB;&#x521B;&#x9020;&#x7684;&#x559C;&#x60A6;&#x3002;</p>
<h3 id="&#x3010;&#x6587;&#x827A;&#x7248;&#x3011;"><a name="&#x3010;&#x6587;&#x827A;&#x7248;&#x3011;" class="anchor-navigation-ex-anchor" href="#&#x3010;&#x6587;&#x827A;&#x7248;&#x3011;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x3010;&#x6587;&#x827A;&#x7248;&#x3011;</h3>
<p>&#x6B63;&#x5982;&#x5B89;&#x5FB7;&#x68EE;&#x6240;&#x8BF4;&#xFF0C;&#x201C;&#x6211;&#x4EEC;&#x90FD;&#x662F;&#x521B;&#x5BA2;&#xFF0C;&#x751F;&#x6765;&#x5982;&#x6B64;&#xFF01;&#x201D;&#x4E0D;&#x8BBA;&#x662F;&#x5728;&#x7827;&#x677F;&#x4E0A;&#x5200;&#x950B;&#x821E;&#x8E48;&#x7684;&#x4E3B;&#x5987;&#x4EEC;&#xFF0C;&#x4EA6;&#x6216;&#x662F;&#x624B;&#x6367;&#x6CE5;&#x5DF4;&#x5FD8;&#x60C5;&#x73A9;&#x800D;&#x7684;&#x5B69;&#x7AE5;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x5FC3;&#x91CC;&#x90FD;&#x4F4F;&#x7740;&#x4E00;&#x4E2A;&#x521B;&#x5BA2;&#xFF0C;&#x521B;&#x9020;&#x662F;&#x6BCF;&#x4E2A;&#x4EBA;&#x4E0E;&#x751F;&#x4FF1;&#x6765;&#x7684;&#x5929;&#x8D4B;&#x548C;&#x6B32;&#x671B;&#x3002;&#x4F46;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#xFF0C;&#x521B;&#x9020;&#x7684;&#x5FEB;&#x4E50;&#x53EA;&#x6709;&#x901A;&#x8FC7;&#x4E0E;&#x4ED6;&#x4EBA;&#x5206;&#x4EAB;&#xFF0C;&#x624D;&#x80FD;&#x6269;&#x5927;&#x548C;&#x5EF6;&#x7EED;&#xFF0C;&#x4E8E;&#x662F;DF&#x521B;&#x5BA2;&#x793E;&#x533A;&#x5E94;&#x8FD0;&#x800C;&#x751F;&#x3002;
&#x6211;&#x4EEC;&#x642D;&#x5EFA;&#x8D77;&#x4E00;&#x4E2A;&#x7EBF;&#x4E0A;&#x521B;&#x5BA2;&#x4EA4;&#x6D41;&#x3001;&#x601D;&#x7EF4;&#x78B0;&#x649E;&#x7684;&#x5E73;&#x53F0;&#xFF0C;&#x9762;&#x5411;&#x521B;&#x5BA2;&#x548C;&#x6E34;&#x671B;&#x6210;&#x4E3A;&#x521B;&#x5BA2;&#x7684;&#x4EBA;&#x4EEC;&#xFF0C;&#x4E00;&#x8D77;&#x52AA;&#x529B;&#x628A;DF&#x521B;&#x5BA2;&#x793E;&#x533A;&#x6253;&#x9020;&#x6210;&#x6700;&#x6709;&#x8DA3;&#x7684;&#x7EBF;&#x4E0A;&#x521B;&#x5BA2;&#x5B66;&#x4E60;&#x4E0E;&#x4EA4;&#x6D41;&#x5E73;&#x53F0;&#x3002;
&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x89C1;&#x8BC1;&#x4E86;&#x53C8;&#x4E00;&#x6279;&#x4F18;&#x79C0;&#x521B;&#x610F;&#x548C;&#x4F5C;&#x54C1;&#x7684;&#x8BDE;&#x751F;&#xFF0C;&#x4E0D;&#x540C;&#x4E13;&#x4E1A;&#x80CC;&#x666F;&#x7684;&#x4EBA;&#x6C47;&#x805A;&#x5230;&#x4E00;&#x8D77;&#x76F8;&#x4E92;&#x4EA4;&#x6D41;&#x8BA8;&#x8BBA;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x78B0;&#x649E;&#x51FA;&#x66F4;&#x591A;&#x65B0;&#x7075;&#x611F;&#xFF0C;&#x6216;&#x662F;&#x76F8;&#x4E92;&#x7ED3;&#x4F34;&#x4E3A;&#x4E00;&#x4E2A;&#x60F3;&#x6CD5;&#x800C;&#x5171;&#x540C;&#x52AA;&#x529B;&#xFF0C;&#x671F;&#x5F85;&#x4F60;&#x7684;&#x52A0;&#x5165;&#xFF01;</p>
<p>&#x70ED;&#x7231;&#x521B;&#x9020;&#x7684;&#x4EBA;&#x90FD;&#x662F;&#x70ED;&#x7231;&#x751F;&#x6D3B;&#x7684;&#x4EBA;&#xFF0C;&#x7231;&#x521B;&#x9020;&#x7684;&#x4EBA;&#x5E94;&#x8BE5;&#x611F;&#x8C22;&#x8FD9;&#x4E2A;&#x65F6;&#x4EE3;&#xFF0C;&#x5E94;&#x8BE5;&#x611F;&#x8C22;&#x5F00;&#x6E90;&#x786C;&#x4EF6;&#x793E;&#x533A;&#x7684;&#x6240;&#x6709;&#x4EBA;&#x62B1;&#x6301;&#x7684;&#x5206;&#x4EAB;&#x7CBE;&#x795E;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x7684;&#x601D;&#x7EF4;&#x548C;&#x521B;&#x610F;&#x5F97;&#x4EE5;&#x65E0;&#x9650;&#x5730;&#x5EF6;&#x4F38;&#xFF0C;&#x811A;&#x6B65;&#x66F4;&#x52A0;&#x4ECE;&#x5BB9;&#x548C;&#x575A;&#x5B9A;&#x3002;&#x53D1;&#x8FBE;&#x7684;&#x8D44;&#x8BAF;&#x7F51;&#x7EDC;&#x548C;&#x65E0;&#x6BD4;&#x7CBE;&#x5F69;&#x7684;&#x521B;&#x5BA2;&#x793E;&#x533A;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5F97;&#x4EE5;&#x66F4;&#x4FBF;&#x6377;&#x5730;&#x89E6;&#x53CA;&#x4E16;&#x754C;&#x5404;&#x5730;&#x4E30;&#x5BCC;&#x591A;&#x5F69;&#x7684;&#x521B;&#x610F;&#x4E0E;&#x521B;&#x9020;&#x3002;</p>
<h3 id="&#x3010;&#x4E25;&#x8083;&#x7248;&#x3011;"><a name="&#x3010;&#x4E25;&#x8083;&#x7248;&#x3011;" class="anchor-navigation-ex-anchor" href="#&#x3010;&#x4E25;&#x8083;&#x7248;&#x3011;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x3010;&#x4E25;&#x8083;&#x7248;&#x3011;</h3>
<p>DF&#x521B;&#x5BA2;&#x793E;&#x533A;&#x662F;&#x4E00;&#x4E2A;&#x7EBF;&#x4E0A;&#x7684;&#x521B;&#x5BA2;&#x5B66;&#x4E60;&#x548C;&#x4EA4;&#x6D41;&#x7684;&#x5E73;&#x53F0;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5728;&#x793E;&#x533A;&#x91CC;&#x5206;&#x4EAB;&#x521B;&#x5BA2;&#x9879;&#x76EE;&#x548C;&#x5B66;&#x4E60;&#x4F7F;&#x7528;&#x4F53;&#x9A8C;&#xFF0C;&#x9762;&#x5411;&#x8BA9;&#x521B;&#x5BA2;&#x548C;&#x60F3;&#x8981;&#x6210;&#x4E3A;&#x521B;&#x5BA2;&#x7684;&#x4EBA;&#x4EEC;&#xFF0C;&#x8BA9;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5728;&#x7EBF;&#x4E0A;&#x8FDB;&#x884C;&#x4EA4;&#x6D41;&#x3001;&#x5408;&#x4F5C;&#xFF0C;&#x4E00;&#x8D77;&#x5206;&#x4EAB;&#x521B;&#x9020;&#x7684;&#x559C;&#x60A6;&#x3002;
DF&#x521B;&#x5BA2;&#x793E;&#x533A;&#x81F4;&#x529B;&#x4E8E;&#x53D1;&#x73B0;&#x548C;&#x5206;&#x4EAB;&#x6709;&#x8DA3;&#x7684;&#x521B;&#x5BA2;&#x9879;&#x76EE;&#x548C;&#x6613;&#x7528;&#x7684;&#x5B66;&#x4E60;&#x6559;&#x7A0B;&#xFF0C;&#x4E3A;&#x521B;&#x5BA2;&#x6587;&#x5316;&#x7684;&#x666E;&#x53CA;&#x548C;&#x964D;&#x4F4E;&#x521B;&#x5BA2;&#x5B66;&#x4E60;&#x7684;&#x95E8;&#x69DB;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x5168;&#x65B0;&#x4E14;&#x9AD8;&#x6548;&#x7684;&#x6E20;&#x9053;&#x3002;&#x793E;&#x533A;&#x7ED3;&#x5408;DFRobot&#x5728;&#x5F00;&#x6E90;&#x786C;&#x4EF6;&#x3001;&#x673A;&#x5668;&#x4EBA;&#x53CA;3D&#x6253;&#x5370;&#x9886;&#x57DF;&#x7684;&#x6280;&#x672F;&#x3001;&#x7814;&#x53D1;&#x4E13;&#x4E1A;&#x4F18;&#x52BF;&#xFF0C;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x4E25;&#x8C28;&#x4E14;&#x6613;&#x7528;&#x7684;&#x521B;&#x5BA2;&#x5165;&#x95E8;&#x6559;&#x7A0B;&#xFF0C;&#x4EE5;&#x53CA;&#x6781;&#x5177;&#x521B;&#x610F;&#x548C;&#x542F;&#x53D1;&#x6027;&#x7684;&#x5F00;&#x6E90;&#x521B;&#x5BA2;&#x9879;&#x76EE;&#xFF0C;&#x8BA9;&#x7528;&#x6237;&#x5728;&#x7EBF;&#x4E0A;&#x5C31;&#x80FD;&#x5B8C;&#x6210;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x5B66;&#x4E60;&#x4F53;&#x9A8C;&#x3002;</p>
<p>&#x5455;&#x5FC3;&#x6CA5;&#x8840;&#x6253;&#x9020;&#x7684;&#x8D85;&#x4E13;&#x4E1A;&#x521B;&#x5BA2;&#x793E;&#x533A;&#x3002;</p>
<p>DF&#x521B;&#x5BA2;&#x793E;&#x533A;&#x81F4;&#x529B;&#x4E8E;&#x53D1;&#x73B0;&#x548C;&#x5206;&#x4EAB;&#x6709;&#x8DA3;&#x7684;&#x521B;&#x5BA2;&#x9879;&#x76EE;&#x548C;&#x6613;&#x7528;&#x7684;&#x5B66;&#x4E60;&#x6559;&#x7A0B;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x4F60;&#x80FD;&#x627E;&#x5230;&#x65B0;&#x5947;&#x7684;&#x60F3;&#x6CD5;&#x548C;&#x6700;&#x9177;&#x7684;&#x7ED3;&#x5408;&#xFF0C;&#x63D0;&#x524D;&#x611F;&#x53D7;&#x4E16;&#x754C;&#x7684;&#x672A;&#x6765;&#x3002;
&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x4F60;&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#x548C;&#x5206;&#x4EAB;&#x65B0;&#x5947;&#x9177;&#x7684;&#x9879;&#x76EE;&#x548C;&#x5B8C;&#x5907;&#x6613;&#x4E0A;&#x624B;&#x7684;&#x5B66;&#x4E60;&#x6559;&#x7A0B;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5C06;&#x4F60;&#x7684;&#x521B;&#x9020;&#x7ECF;&#x5386;&#x4E0E;&#x4ED6;&#x4EBA;&#x5206;&#x4EAB;&#xFF0C;&#x7ED3;&#x8BC6;&#x76F8;&#x4F3C;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x4E00;&#x8D77;&#x521B;&#x9020;&#x3002;</p>
<h3 id="&#x3010;&#x62D4;&#x9AD8;&#x7248;&#x3011;"><a name="&#x3010;&#x62D4;&#x9AD8;&#x7248;&#x3011;" class="anchor-navigation-ex-anchor" href="#&#x3010;&#x62D4;&#x9AD8;&#x7248;&#x3011;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x3010;&#x62D4;&#x9AD8;&#x7248;&#x3011;</h3>
<p>DF&#x521B;&#x5BA2;&#x793E;&#x533A;&#x662F;&#x56FD;&#x5185;&#x77E5;&#x540D;&#x7684;&#x521B;&#x5BA2;&#x793E;&#x533A;&#xFF0C;&#x81F4;&#x529B;&#x4E8E;&#x53D1;&#x73B0;&#x548C;&#x5206;&#x4EAB;&#x6709;&#x8DA3;&#x7684;&#x521B;&#x5BA2;&#x9879;&#x76EE;&#x548C;&#x6613;&#x7528;&#x7684;&#x5B66;&#x4E60;&#x6559;&#x7A0B;&#x7CFB;&#x5217;&#xFF0C;&#x4E3A;&#x521B;&#x5BA2;&#x6587;&#x5316;&#x7684;&#x666E;&#x53CA;&#x548C;&#x964D;&#x4F4E;&#x521B;&#x5BA2;&#x5B66;&#x4E60;&#x7684;&#x95E8;&#x69DB;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x5168;&#x65B0;&#x4E14;&#x9AD8;&#x6548;&#x7684;&#x6E20;&#x9053;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x4ECE;&#x521B;&#x5BA2;&#x5165;&#x95E8;&#x5230;&#x8FBE;&#x4EBA;&#x7684;&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#xFF0C;&#x5206;&#x4EAB;&#x521B;&#x5BA2;&#x9879;&#x76EE;&#x548C;&#x5B66;&#x4E60;&#x4F7F;&#x7528;&#x4F53;&#x9A8C;&#x3002;
&#x4E3A;&#x63A8;&#x52A8;&#x4E2D;&#x56FD;&#x521B;&#x5BA2;&#x6559;&#x80B2;&#x4E8B;&#x4E1A;&#x7684;&#x53D1;&#x5C55;&#x505A;&#x51FA;&#x4E86;&#x5353;&#x8D8A;&#x7684;&#x8D21;&#x732E;&#x3002;</p>
<h3 id="&#x3010;&#x7533;&#x62A5;&#x7248;&#x3011;"><a name="&#x3010;&#x7533;&#x62A5;&#x7248;&#x3011;" class="anchor-navigation-ex-anchor" href="#&#x3010;&#x7533;&#x62A5;&#x7248;&#x3011;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x3010;&#x7533;&#x62A5;&#x7248;&#x3011;</h3>
<p>DF&#x521B;&#x5BA2;&#x6559;&#x80B2;&#x5E73;&#x53F0;&#x7531; DF&#x521B;&#x5BA2;&#x793E;&#x533A;&#x8FD9;&#x4E2A;&#x7EBF;&#x4E0A;&#x5206;&#x4EAB;&#x5E73;&#x53F0;&#x53D1;&#x5C55;&#x800C;&#x6765;&#xFF0C;&#x76EE;&#x6807;&#x4EE5;&#x5BA2;&#x6559;&#x80B2;&#x4E3A;&#x6838;&#x5FC3;&#xFF0C;&#x96C6;&#x521B;&#x5BA2;&#x6559;&#x80B2;&#x4EA7;&#x54C1;&#x7814;&#x53D1;&#x3001;&#x521B;&#x5BA2;&#x5B66;&#x4E60;&#x5DE5;&#x5177;&#x5F00;&#x53D1;&#x3001;&#x521B;&#x5BA2;&#x6559;&#x80B2;&#x670D;&#x52A1;&#x7B49;&#x4E8E;&#x4E00;&#x4F53;&#x7684;&#x7EFC;&#x5408;&#x6027;&#x521B;&#x5BA2;&#x6559;&#x80B2;&#x5E73;&#x53F0;&#x3002;</p>
<p>DF &#x521B;&#x5BA2;&#x6559;&#x80B2;&#x5E73;&#x53F0;&#x662F;&#x81F4;&#x529B;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x4FBF;&#x6377;&#x3001;&#x4F18;&#x8D28;&#x7684;&#x5168;&#x65B9;&#x4F4D;&#x5B66;&#x4E60;&#x4EA7;&#x54C1;&#x548C;&#x4E13;&#x4E1A;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x6253;&#x901A;&#x521B;&#x5BA2;&#x6559;&#x80B2;&#x5185;&#x5BB9;&#x63D0;&#x4F9B;&#x8005;&#x548C;&#x5B66;&#x751F;&#x95F4;&#x7684;&#x901A;&#x9053;&#x3002;&#x6253;&#x9020;&#x96C6;&#x9886;&#x5148;&#x7684;&#x5B66;&#x4E60;&#x8D44;&#x8BAF;&#x3001; &#x5B66;&#x4E60;&#x793E;&#x533A;&#x3001;&#x5B66;&#x4E60;&#x5DE5;&#x5177;&#x53CA;&#x5E73;&#x53F0;&#x56DB;&#x5927;&#x4E1A;&#x52A1;&#x6A21;&#x5757;&#xFF0C;&#x6DB5;&#x76D6;&#x7535;&#x5B50;&#x5236;&#x4F5C;&#x3001;3D&#x6253;&#x5370;&#x3001;&#x673A;&#x5668;&#x4EBA; &#x3001;&#x673A;&#x5668;&#x4EBA;&#x6559;&#x80B2;&#x7B49;&#x4E30;&#x5BCC;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x4E3A;&#x4ECE;&#x4E8B;&#x521B;&#x5BA2;&#x8001;&#x5E08;&#x63D0;&#x4F9B;&#x4E30;&#x5BCC;&#x7684;&#x5185;&#x5BB9;&#x8D44;&#x6E90;&#xFF0C;&#x4E3A;&#x5B66;&#x751F;&#x5728;&#x6559;&#x80B2;&#x7684;&#x5B66;&#x4E60;&#x548C;&#x5206;&#x4EAB;&#x5DE5;&#x5177;&#x3002;</p>
<h4 id="&#x3010;keywords&#x3011;"><a name="&#x3010;keywords&#x3011;" class="anchor-navigation-ex-anchor" href="#&#x3010;keywords&#x3011;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x3010;keywords&#x3011;</h4>
<p>DFRobot,&#x521B;&#x5BA2;,&#x521B;&#x5BA2;&#x793E;&#x533A;,&#x521B;&#x5BA2;&#x8BBA;&#x575B;, &#x5355;&#x7247;&#x673A;,&#x521B;&#x5BA2;&#x5165;&#x95E8;,DIY,&#x9AD8;&#x7EA7;DIY,&#x7535;&#x5B50;DIY,&#x5F00;&#x6E90;&#x786C;&#x4EF6;, &#x5F00;&#x6E90;&#x793E;&#x533A;,Arduino,Arduino&#x5165;&#x95E8;,Arduino &#x5E73;&#x53F0;,Arduino &#x673A;&#x5668;&#x4EBA;,Arduino &#x8BBA;&#x575B;,Arduino&#x8D2D;&#x4E70;,Arduino&#x6559;&#x7A0B;, &#x673A;&#x5668;&#x4EBA;,&#x673A;&#x5668;&#x4EBA;&#x793E;&#x533A;,&#x673A;&#x5668;&#x4EBA;&#x8BBA;&#x575B;,3D&#x6253;&#x5370;&#x8BBA;&#x575B;,3D &#x6253;&#x5370;&#x673A;, 3D&#x6253;&#x5370;,Arduino&#x8D2D;&#x4E70;,&#x6280;&#x672F;&#x5B85;,&#x6280;&#x672F;&#x5927;&#x795E;,&#x505A;&#x4E1C;&#x897F;</p>
<h4 id="&#x3010;&#x7528;&#x6237;&#x91CF;&#x7EA7;&#x3011;"><a name="&#x3010;&#x7528;&#x6237;&#x91CF;&#x7EA7;&#x3011;" class="anchor-navigation-ex-anchor" href="#&#x3010;&#x7528;&#x6237;&#x91CF;&#x7EA7;&#x3011;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x3010;&#x7528;&#x6237;&#x91CF;&#x7EA7;&#x3011;</h4>
<p>2014.2 1905
2015.1 6243
2016.1.1 10500
2016.7.1 14002</p>
<p>DF Maker Community is dedicated to discovering and sharing innovative maker projects and learning tutorials.
It combines DFRobot&apos;s expertise in open source hardware, robots, and 3D printing to provide a range of rigorous and easy-to-use introductory tutorials, as well as creative and inspiring open source projects that allow users to complete a high quality learning experience Online.
DFRobot also provides teachers with the training, resources, and support their need to engage students in real-world learning.</p>
<h6 id="&#x7CBE;&#x5FC3;&#x8BBE;&#x8BA1;&#x3001;&#x8BE6;&#x7EC6;&#x5B8C;&#x5907;&#x7684;&#x521B;&#x5BA2;&#x8BFE;&#x7A0B;"><a name="&#x7CBE;&#x5FC3;&#x8BBE;&#x8BA1;&#x3001;&#x8BE6;&#x7EC6;&#x5B8C;&#x5907;&#x7684;&#x521B;&#x5BA2;&#x8BFE;&#x7A0B;" class="anchor-navigation-ex-anchor" href="#&#x7CBE;&#x5FC3;&#x8BBE;&#x8BA1;&#x3001;&#x8BE6;&#x7EC6;&#x5B8C;&#x5907;&#x7684;&#x521B;&#x5BA2;&#x8BFE;&#x7A0B;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x7CBE;&#x5FC3;&#x8BBE;&#x8BA1;&#x3001;&#x8BE6;&#x7EC6;&#x5B8C;&#x5907;&#x7684;&#x521B;&#x5BA2;&#x8BFE;&#x7A0B;</h6>
<p>5&#x5E74;&#x6765;DFRobot&#x7EC6;&#x5FC3;&#x603B;&#x7ED3;&#x6BCF;&#x4E00;&#x4F4D;&#x521B;&#x5BA2;&#x7684;&#x53CD;&#x9988;&#xFF0C;&#x94BB;&#x7814;&#x6BCF;&#x4E00;&#x4EFD;&#x4F18;&#x79C0;&#x6559;&#x7A0B;&#xFF0C;&#x4E3A;&#x4F60;&#x7EC6;&#x5FC3;&#x6311;&#x9009;&#x6BCF;&#x4E00;&#x4E2A;&#x5143;&#x4EF6;&#xFF0C;&#x7528;&#x5FC3;&#x8BBE;&#x8BA1;&#x6BCF;&#x4E00;&#x4E2A;&#x5B9E;&#x9A8C;&#xFF0C;&#x53CD;&#x590D;&#x659F;&#x914C;&#x6BCF;&#x4E00;&#x7BC7;&#x6559;&#x7A0B;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x7684;&#x521B;&#x5BA2;&#x8BFE;&#x7A0B;&#x6781;&#x6613;&#x5B66;&#x4E60;&#xFF0C;&#x914D;&#x4E0A;&#x5236;&#x4F5C;&#x7CBE;&#x826F;&#x3001;&#x7528;&#x5FC3;&#x4F18;&#x5316;&#x8FC7;&#x7684;&#x521B;&#x5BA2;&#x5B66;&#x4E60;&#x5957;&#x4EF6;&#xFF0C;&#x8BA9;&#x521B;&#x5BA2;&#x5B66;&#x4E60;&#x4F53;&#x9A8C;&#x66F4;&#x52A0;&#x987A;&#x7545;&#x3002;</p>
<h6 id="&#x5145;&#x6EE1;&#x521B;&#x610F;&#x7684;&#x521B;&#x5BA2;&#x5C55;&#x793A;&#x9879;&#x76EE;"><a name="&#x5145;&#x6EE1;&#x521B;&#x610F;&#x7684;&#x521B;&#x5BA2;&#x5C55;&#x793A;&#x9879;&#x76EE;" class="anchor-navigation-ex-anchor" href="#&#x5145;&#x6EE1;&#x521B;&#x610F;&#x7684;&#x521B;&#x5BA2;&#x5C55;&#x793A;&#x9879;&#x76EE;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x5145;&#x6EE1;&#x521B;&#x610F;&#x7684;&#x521B;&#x5BA2;&#x5C55;&#x793A;&#x9879;&#x76EE;</h6>
<p>&#x878D;&#x5165;&#x65B0;&#x5947;&#x60F3;&#x6CD5;&#x7684;&#x521B;&#x5BA2;&#x4F5C;&#x54C1;
&#x5B8C;&#x6574;&#x7684;&#x5236;&#x4F5C;&#x6B65;&#x9AA4;</p>
<p><footer class="page-footer"><span class="copyright">Copyright &#xA9; DF&#x521B;&#x5BA2;&#x793E;&#x533A; 2020 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x4EF6;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2020-04-03 08:56:56
</span></footer></p>
<div id="gitalk-container"></div>

<pre class="language-"><code class="lang-html">&#x4F5C;&#x8005;: DF&#x521B;&#x5BA2;&#x793E;&#x533A;
&#x94FE;&#x63A5;: https://mc.dfrobot.com.cn/
&#x6765;&#x6E90;: DF&#x521B;&#x5BA2;&#x793E;&#x533A;
&#x672C;&#x6587;&#x539F;&#x521B;&#x53D1;&#x5E03;&#x4E8E;&#x300C;DF&#x521B;&#x5BA2;&#x793E;&#x533A;&#x300D;,&#x8F6C;&#x8F7D;&#x8BF7;&#x6CE8;&#x660E;&#x51FA;&#x5904;,&#x8C22;&#x8C22;&#x5408;&#x4F5C;!
</code></pre>
<p><img src="https://mc.dfrobot.com.cn/template/zhanzhuai_v/images/logo.png" alt="https://mc.dfrobot.com.cn/template/zhanzhuai_v/images/logo.png"></p>
 <link rel="stylesheet" type="text/css" href="https://storage.googleapis.com/app.klipse.tech/css/codemirror.css"> <script>     window.klipse_settings = {         selector: ".language-klipse, .lang-eval-clojure",         selector_eval_js: ".lang-eval-js",         selector_eval_python_client: ".lang-eval-python",         selector_eval_php: ".lang-eval-php",         selector_eval_scheme: ".lang-eval-scheme",         selector_eval_ruby: ".lang-eval-ruby",         selector_reagent: ".lang-reagent",        selector_google_charts: ".lang-google-chart",        selector_es2017: ".lang-eval-es2017",        selector_jsx: ".lang-eval-jsx",        selector_transpile_jsx: ".lang-transpile-jsx",        selector_render_jsx: ".lang-render-jsx",        selector_react: ".lang-react",        selector_eval_markdown: ".lang-render-markdown",        selector_eval_lambdaway: ".lang-render-lambdaway",        selector_eval_cpp: ".lang-eval-cpp",        selector_eval_html: ".lang-render-html",        selector_sql: ".lang-eval-sql",        selector_brainfuck: "lang-eval-brainfuck",        selector_js: ".lang-transpile-cljs"    }; </script> <script src="https://storage.googleapis.com/app.klipse.tech/plugin/js/klipse_plugin.js"></script>
</div>

                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"介绍","level":"1.1","depth":1,"next":{"title":"文章汇总","level":"1.2","depth":1,"ref":"","articles":[{"title":"哈士奇","level":"1.2.1","depth":2,"path":"哈士奇.MD","ref":"哈士奇.MD","articles":[]},{"title":"三个测温器","level":"1.2.2","depth":2,"path":"三个测温器.MD","ref":"三个测温器.MD","articles":[]},{"title":"时空传送枪","level":"1.2.3","depth":2,"path":"时空传送枪.MD","ref":"时空传送枪.MD","articles":[]},{"title":"树莓派是什么？能吃吗？","level":"1.2.4","depth":2,"path":"树莓派是什么？能吃吗？.md","ref":"树莓派是什么？能吃吗？.md","articles":[]},{"title":"情人节专属时钟","level":"1.2.5","depth":2,"path":"Sequino.md","ref":"Sequino.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["-lunr","-search","-highlight","-livereload","search-plus@^0.0.11","simple-page-toc@^0.1.1","github@^2.0.0","github-buttons@2.1.0","edit-link@^2.0.2","prism@^2.1.0","prism-themes@^0.0.2","advanced-emoji@^0.2.1","anchors@^0.7.1","include-codeblock@^3.0.2","ace@^0.3.2","emphasize@^1.1.0","katex@^1.1.3","splitter@^0.0.8","mermaid-gb3@2.1.0","tbfed-pagefooter@^0.0.1","expandable-chapters-small@^0.1.7","sectionx@^3.1.0","donate@^1.0.2","local-video@^1.0.1","sitemap-general@^0.1.1","anchor-navigation-ex@0.1.8","favicon@^0.0.2","todo@^0.1.3","terminal@^0.3.2","alerts@^0.2.0","include-csv@^0.1.0","puml@^1.0.1","musicxml@^1.0.2","klipse@^1.2.0","rss@^3.0.2","-sharing","sharing-plus@^0.0.2","graph@^0.1.0","chart@^0.2.0","mygitalk","copyright","openwrite","-expandable-chapters-small","expandable-chapters","chapter-fold","livereload"],"root":".","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright © DF创客社区 2020","modify_label":"该文件修订时间：","modify_format":"YYYY-MM-DD HH:mm:ss"},"chapter-fold":{},"prism":{"css":["prism-themes/themes/prism-base16-ateliersulphurpool.light.css"]},"include-csv":{},"emphasize":{},"ace":{},"github":{"url":"https://github.com/RalstonLiu/gitbook"},"puml":{},"simple-page-toc":{"maxDepth":3,"skipFirstH1":true},"todo":{},"splitter":{},"copyright":{"copyProtect":true,"site":"https://mc.dfrobot.com.cn/","author":"DF创客社区","website":"DF创客社区","image":"https://mc.dfrobot.com.cn/template/zhanzhuai_v/images/logo.png"},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"graph":{},"donate":{"alipay":"https://blog.yirenliu.cn/img/alipay.JPG","alipayText":"支付宝打赏","button":"赏","title":"","wechat":"https://blog.yirenliu.cn/img/wechat.JPG","wechatText":"微信打赏"},"sitemap-general":{"prefix":"https://blog.yirenliu.cn/gitbook/"},"katex":{},"fontsettings":{"theme":"white","family":"sans","size":2},"rss":{"categories":["gitbook"],"title":"GitBook 使用教程","description":"记录 GitBook 的配置和一些插件的使用","author":"Jikai Zhang","feed_url":"https://blog.yirenliu.cn/gitbook/rss","site_url":"https://blog.yirenliu.cn/gitbook/","managingEditor":"ralstonish@gmail.com","webMaster":"ralstonish@gmail.com"},"musicxml":{},"sectionx":{"tag":"b"},"mermaid-gb3":{},"anchor-navigation-ex":{"isRewritePageTitle":false,"tocLevel1Icon":"fa fa-hand-o-right","tocLevel2Icon":"fa fa-hand-o-right","tocLevel3Icon":"fa fa-hand-o-right"},"favicon":{"shortcut":"favicon.ico","bookmark":"favicon.ico"},"openwrite":{"blogId":"21047-1585809350246-642","name":"DF创客社区","qrcode":"http://df.yirenliu.cn/FrbGVMroj_tBa1OR9EcyPBzJ3ba_","keyword":"VIP"},"prism-themes":{},"alerts":{},"github-buttons":{"repo":"RalstonLiu/gitbook","types":["star"],"size":"small"},"local-video":{},"mygitalk":{"flipMoveOptions":{},"clientID":"080aebb9a762ed51c5d9","number":-1,"perPage":10,"proxy":"https://cors-anywhere.herokuapp.com/https://github.com/login/oauth/access_token","admin":["RalstonLiu"],"createIssueManually":false,"distractionFreeMode":false,"repo":"gitbook","owner":"RalstonLiu","enableHotKey":true,"clientSecret":"1abbb460c75e055fbd51c6e04c6b7b4ac47a6e69","pagerDirection":"last","labels":["Gitalk"]},"klipse":{"myConfigKey":"it's the default value"},"advanced-emoji":{"embedEmojis":false},"include-codeblock":{"check":false,"edit":true,"fixlang":false,"lang":"","template":"ace","theme":"chrome","unindent":true},"sharing":{"qq":false,"all":["facebook","google","twitter","weibo","instapaper","linkedin","pocket","stumbleupon","qq","qzone"],"douban":false,"facebook":false,"weibo":true,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":false,"messenger":false,"line":false,"vk":false,"pocket":false,"google":true,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":true},"terminal":{"copyButtons":true,"fade":false,"style":"flat"},"edit-link":{"label":"Edit This Page","base":"https://github.com/RalstonLiu/gitbook/edit/master"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":true},"anchors":{},"chart":{"type":"c3"},"expandable-chapters":{},"search-plus":{}},"theme":"default","author":"Roy","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"GitBook 使用教程","language":"zh-hans","output.name":"site","links":{"sidebar":{"Home":"https://blog.yirenliu.cn/gitbook/"}},"gitbook":"3.2.3","description":"记录 GitBook 的配置和一些插件的使用"},"file":{"path":"README.md","mtime":"2020-04-03T00:56:56.197Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-04-03T01:49:41.003Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    

    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-ace/ace/ace.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-ace/ace.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-mermaid-gb3/book/plugin.js"></script>
        
    
        
        <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sectionx/sectionx.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-donate/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-local-video/video.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-terminal/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-alerts/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-musicxml/osmd.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-musicxml/musicxml.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-musicxml/promise.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-rss/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="https://cdn.bootcss.com/blueimp-md5/2.12.0/js/md5.min.js"></script>
        
    
        
        <script src="https://unpkg.com/gitalk/dist/gitalk.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-mygitalk/mygitalk.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-copyright/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

<script src="https://my.openwrite.cn/js/readmore.js" type="text/javascript"></script>
<script>
var isMobile = navigator.userAgent.match(/(phone|pad|pod|iPhone|iPod|ios|iPad|Android|Mobile|BlackBerry|IEMobile|MQQBrowser|JUC|Fennec|wOSBrowser|BrowserNG|WebOS|Symbian|Windows Phone)/i);
if (!isMobile) {
    var btw = new BTWPlugin();
    btw.init({
        "id": "vip-container",
        "blogId": "21047-1585809350246-642",
        "name": "DF创客社区",
        "qrcode": "http://df.yirenliu.cn/FrbGVMroj_tBa1OR9EcyPBzJ3ba_",
        "keyword": "VIP"
    });
}
</script>

    <script src="gitbook/gitbook-plugin-mermaid-gb3/mermaid/mermaid.min.js"></script>

    </body>
</html>

