
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>二哈识图 · 编写gitbook电子书教程</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="sphard">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-donate/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="./" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"repo":"darrenliuwei/gitbook","types":["star"],"size":"small"};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="二哈识图品牌.html">
            
                <a href="二哈识图品牌.html">
            
                    
                    二哈识图
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >二哈识图</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                
                <div id="vip-container">
                    <h2 id="&#x5F00;&#x5934;">&#x5F00;&#x5934;</h2>
<p>&#x5728;&#x7F8E;&#x56FD;&#xFF0C;&#x8F66;&#x5E93;&#x548C;&#x5730;&#x4E0B;&#x5BA4;&#x5BF9;&#x6BCF;&#x4E2A;&#x7F8E;&#x56FD;&#x4EBA;&#x800C;&#x8A00;&#xFF0C;&#x51E0;&#x4E4E;&#x662F;&#x751F;&#x6D3B;&#x4E0D;&#x53EF;&#x6216;&#x7F3A;&#x7684;&#x7A7A;&#x95F4;&#x3002;</p>
<p><img src="http://df.yirenliu.cn/Fh7LIar6KgVHB291LAKMwAaCeNkL" alt=""></p>
<p>&#x8F66;&#x5E93;&#x91CC;&#x8BDE;&#x751F;&#x7684;&#x8457;&#x540D;&#x79D1;&#x6280;&#x516C;&#x53F8;&#x5F88;&#x591A;&#x3002;</p>
<p>&#x7F8E;&#x56FD;&#x7845;&#x8C37;&#x7684;&#x9F3B;&#x7956;&#x2014;&#x2014;&#x60E0;&#x666E;&#x3002;&#x60E0;&#x666E;&#x5F53;&#x5E74;&#x7684;&#x521B;&#x4E1A;&#x8F66;&#x5E93;&#x3002;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x7845;&#x8C37;&#x7684;&#x8BDE;&#x751F;&#x5730;&#x201D;&#xFF0C;&#x662F;&#x5168;&#x7403;&#x521B;&#x5BA2;&#x4EEC;&#x7684;&#x671D;&#x5723;&#x4E4B;&#x5730;&#x3002;
<img src="http://df.yirenliu.cn/FuGtS8ITfoIwB9KLFRn7Tgtg93dT" alt=""></p>
<p><img src="http://df.yirenliu.cn/FrpTdJHhODaNyuXjle0O-MG9Kje2" alt=""></p>
<p>&#x8F70;&#x52A8;&#x7535;&#x8111;&#x754C;&#x7684;&#x8F66;&#x5E93;&#x9769;&#x547D;&#x2014;&#x2014;&#x82F9;&#x679C;&#x3002;&#x81EA;&#x60E0;&#x666E;&#x516C;&#x53F8;&#x4ECE;&#x521B;&#x4E1A;&#x540E;37&#x5E74;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;1976&#x5E74;&#xFF0C;&#x7F8E;&#x56FD;&#x7845;&#x8C37;&#x201C;&#x5BB6;&#x917F;&#x7535;&#x8111;&#x4FF1;&#x4E50;&#x90E8;&#x201D;&#x7684;&#x4E24;&#x4F4D;&#x9752;&#x5E74;&#xFF0C;&#x5F15;&#x8D77;&#x4E86;&#x4E00;&#x573A;&#x8F70;&#x52A8;&#x7535;&#x8111;&#x4E1A;&#x754C;&#x7684;&#x201C;&#x8F66;&#x5E93;&#x9769;&#x547D;&#x201D;&#x3002;&#x8FD8;&#x6709;&#x5728;&#x8F66;&#x5E93;&#x5BFB;&#x627E;&#x7075;&#x611F;&#x7684;&#x5927;&#x516C;&#x53F8;&#x2014;&#x2014;&#x8FEA;&#x58EB;&#x5C3C;&#xFF0C;A Spec&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x8EAB;&#x5904;&#x56FD;&#x5185;&#xFF0C;&#x5C3D;&#x7BA1;&#x53EF;&#x4EE5;&#x5728;&#x6210;&#x5343;&#x4E0A;&#x767E;&#x5BB6;&#x7535;&#x5B50;&#x5546;&#x57CE;&#x91CC;&#x4E70;&#x5230;&#x9700;&#x8981;&#x7684;&#x5404;&#x79CD;&#x7535;&#x5B50;&#x5143;&#x5668;&#x4EF6;&#xFF0C;&#x4F46;&#x5728;&#x5927;&#x57CE;&#x5E02;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5317;&#x4E0A;&#x5E7F;&#x6DF1;&#xFF0C;&#x7531;&#x4E8E;&#x623F;&#x4EF7;&#x7B49;&#x539F;&#x56E0;&#xFF0C;&#x5F88;&#x5C11;&#x6709;&#x548C;&#x7F8E;&#x56FD;&#x7684;&#x8F66;&#x5E93;&#x8FD9;&#x6837;&#x7C7B;&#x4F3C;&#x7684;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x4E8E;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x8054;&#x5408;&#x6D66;&#x8F6F;&#x5B75;&#x5316;&#x5668;&#xFF0C;&#x5728;Rockets&#x7684;&#x5E2E;&#x5FD9;&#x4E0B;&#x521B;&#x7ACB;&#x4E86;&#x4E0A;&#x6D77;&#x6D66;&#x4E1C;&#x7684;&#x7B2C;&#x4E00;&#x5BB6;&#x521B;&#x5BA2;&#x7A7A;&#x95F4;&#x2014;&#x2014;&#x8611;&#x83C7;&#x4E91;&#x521B;&#x5BA2;&#x7A7A;&#x95F4;&#x3002;
<img src="http://df.yirenliu.cn/lrfE8WefxSYXH2rw3XH10ZDDKn0M" alt=""></p>
<p>&#x4E3A;&#x786C;&#x4EF6;&#x7231;&#x597D;&#x8005;&#x3001;&#x7A0B;&#x5E8F;&#x5458;&#x3001;&#x8BBE;&#x8BA1;&#x5E08;&#x3001;DIY &#x53D1;&#x70E7;&#x53CB;&#x7B49;&#x5404;&#x7C7B;&#x521B;&#x5BA2;&#xFF0C;&#x751A;&#x81F3;&#x5305;&#x62EC;&#x8FDB;&#x884C;&#x521B;&#x65B0;&#x7814;&#x53D1;&#x7684;&#x79D1;&#x521B;&#x56E2;&#x961F;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5F00;&#x653E;&#x5F0F;&#x7684;&#x4EA4;&#x6D41;&#x5E73;&#x53F0;&#x3002;</p>
<blockquote>
<p>&#x201C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x6211;&#x4EEC;&#x7684;&#x805A;&#x96C6;&#x597D;&#x6BD4;&#x6838;&#x53CD;&#x5E94;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x521B;&#x5BA2;&#x6587;&#x5316;&#x50CF;&#x94FE;&#x5F0F;&#x53CD;&#x5E94;&#x4E00;&#x6837;&#x4F20;&#x64AD;&#x51FA;&#x53BB;&#x3002;&#x201D;</p>
</blockquote>
<p>&#x4ECE;2013&#x5E74;&#x6210;&#x7ACB;&#x4EE5;&#x6765;&#xFF0C;&#x8FD9;&#x4E2A;&#x5174;&#x8DA3;&#x76F8;&#x6295;&#x7684;&#x521B;&#x5BA2;&#x805A;&#x96C6;&#x5730;&#x5DF2;&#x7ECF;&#x53D1;&#x5C55;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x5E2E;&#x52A9;&#x63A8;&#x51FA;&#x4E86;&#x5404;&#x79CD;&#x4EA7;&#x54C1;&#x2014;&#x2014;&#x4ECE; OverLord 3D&#x6253;&#x5370;&#x673A;&#x5230;&#x56DB;&#x8F74;&#x65E0;&#x4EBA;&#x673A;&#x3001;&#x4ECE;&#x6FC0;&#x5149;&#x952E;&#x76D8;&#x5230;&#x7535;&#x52A8;&#x6ED1;&#x677F;&#xFF0C;&#x8FD8;&#x6709;&#xFF0C;&#x524D;&#x4E0D;&#x4E45;&#x521A;&#x521A;&#x53D1;&#x5E03;&#x7684;&#x4E8C;&#x54C8;&#x8BC6;&#x56FE;&#xFF08;Huskylens&#xFF09;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x4F20;&#x611F;&#x5668;&#x3002;
<img src="http://df.yirenliu.cn/FmC9lyNw7vKLEGDC60ri51N9-NyZ" alt=""></p>
<p>&#x5982;&#x4F55;&#x8BA9;&#x6280;&#x672F;&#x66F4;&#x5E7F;&#x6CDB;&#x5730;&#x4F7F;&#x7528;&#x4E00;&#x76F4;&#x662F;DFRobot&#x7684;&#x521B;&#x5BA2;&#x4EEC;&#x5FC3;&#x5FC3;&#x5FF5;&#x5FF5;&#x7684;&#xFF0C;&#x800C;&#x4E8C;&#x54C8;&#x8BC6;&#x56FE;&#xFF08;HuskyLens&#xFF09;&#x5C31;&#x662F;&#x8BA9;&#x8FD9;&#x4E2A;&#x5FC3;&#x613F;&#x5F97;&#x4EE5;&#x6210;&#x529F;&#x5B9E;&#x73B0;&#x6700;&#x68D2;&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6CA1;&#x6709;&#x8611;&#x83C7;&#x4E91;&#x521B;&#x5BA2;&#x4EEC;&#x7684;&#x5E2E;&#x52A9;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x65E0;&#x6CD5;&#x8FD9;&#x4E48;&#x5FEB;&#x5F00;&#x53D1;&#x51FA;&#x80FD;&#x591F;&#x8BC6;&#x522B;&#x96C6;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x3001;&#x7269;&#x4F53;&#x8BC6;&#x522B;&#x3001;&#x7269;&#x4F53;&#x8FFD;&#x8E2A;&#x3001;&#x989C;&#x8272;&#x8BC6;&#x522B;&#x3001;&#x5DE1;&#x7EBF;&#x3001;&#x4E8C;&#x7EF4;&#x7801;&#x6807;&#x7B7E;&#x8BC6;&#x522B;6&#x5927;&#x529F;&#x80FD;&#x4E8E;&#x4E00;&#x8EAB;&#x7684;AI&#x89C6;&#x89C9;&#x4F20;&#x611F;&#x5668;&#x3002;
<img src="http://df.yirenliu.cn/Fv_anM27lXFE2Wwj8ivx7vzDSCqP" alt=""></p>
<p>Rockets&#x8BF4;&#xFF1A;&#x201C; HuskyLens&#x5C06;&#x76EE;&#x524D;&#x6700;&#x524D;&#x6CBF;&#x7684;&#x673A;&#x5668;&#x89C6;&#x89C9;&#x5E26;&#x7ED9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x751A;&#x81F3;&#x662F;&#x65B0;&#x624B;&#xFF0C;&#x8BA9;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x66F4;&#x8F7B;&#x677E;&#x5730;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#x3002;&#x201D;</p>
<p>&#x4E8C;&#x54C8;&#x8BC6;&#x56FE;&#xFF08;HuskyLens&#xFF09;&#x4E0E;Arduino&#xFF0C;Raspberry Pi&#xFF0C;LattePanda&#x6216;micro&#xFF1A;bit&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x9879;&#x76EE;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5236;&#x4F5C;&#x5404;&#x79CD;&#x4EA4;&#x4E92;&#x5F0F;&#x827A;&#x672F;&#x4F5C;&#x54C1;&#xFF0C;&#x6446;&#x8131;&#x4E86;&#x7E41;&#x7410;&#x7684;&#x8BAD;&#x7EC3;&#x548C;&#x590D;&#x6742;&#x7684;&#x89C6;&#x89C9;&#x7B97;&#x6CD5;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x66F4;&#x52A0;&#x4E13;&#x6CE8;&#x4E8E;&#x9879;&#x76EE;&#x7684;&#x6784;&#x601D;&#x548C;&#x5B9E;&#x73B0;&#x3002;</p>
<blockquote>
<p>&#x201C;&#x5341;&#x5E74;&#x524D;&#xFF0C;&#x8BB8;&#x591A;&#x673A;&#x5668;&#x4EBA;&#x96F6;&#x4EF6;&#x975E;&#x5E38;&#x6602;&#x8D35;&#x3002;&#x968F;&#x7740;&#x5F00;&#x6E90;&#x8FD0;&#x52A8;&#x548C;&#x521B;&#x5BA2;&#x6587;&#x5316;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x6211;&#x4EEC;&#x610F;&#x8BC6;&#x5230;&#x5171;&#x4EAB;&#x786C;&#x4EF6;&#x548C;&#x6280;&#x672F;&#x77E5;&#x8BC6;&#x5C06;&#x6709;&#x52A9;&#x4E8E;&#x6211;&#x4EEC;&#x521B;&#x9020;&#x66F4;&#x7F8E;&#x597D;&#x7684;&#x672A;&#x6765;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x63D0;&#x4F9B;&#x95E8;&#x69DB;&#x8F83;&#x4F4E;&#x7684;&#x673A;&#x5668;&#x4EBA;&#x914D;&#x4EF6;&#x3002;&#x201D;</p>
</blockquote>
<p>Youyou Yu&#x662F;&#x6211;&#x4EEC;&#x4E8C;&#x54C8;&#x8BC6;&#x56FE;&#xFF08;HuskyLens&#xFF09;&#x7684;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#xFF0C;&#x65E9;&#x5728;&#x4E00;&#x5E74;&#x524D;&#xFF0C;&#x56E2;&#x961F;&#x5C31;&#x5F00;&#x59CB;&#x7814;&#x7A76;&#x600E;&#x6837;&#x624D;&#x80FD;&#x8BA9;&#x521B;&#x5BA2;&#x4EEC;&#x66F4;&#x5BB9;&#x6613;&#x5730;&#x5728;&#x81EA;&#x5DF1;&#x9879;&#x76EE;&#x5236;&#x4F5C;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F7F;&#x7528;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x89C6;&#x89C9;&#x3002;</p>
<p>&#x65E9;&#x671F;&#x4F7F;&#x7528;OpenTLD&#x4E4B;&#x7C7B;&#x7684;&#x6280;&#x672F;&#xFF08;&#x57FA;&#x4E8E;&#x5F00;&#x653E;&#x6E90;&#x4EE3;&#x7801;&#x5E93;&#x7684;&#x7B97;&#x6CD5;&#xFF09;&#x8FDB;&#x884C;&#x7684;&#x6D4B;&#x8BD5;&#x672A;&#x80FD;&#x6210;&#x529F;&#xFF0C;&#x65B0;&#x7684;K210&#x5904;&#x7406;&#x5668;&#x82AF;&#x7247;&#x53EF;&#x4E3A;&#x8FD0;&#x884C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7B97;&#x6CD5;&#x63D0;&#x4F9B;&#x66F4;&#x5FEB;&#x7684;&#x5904;&#x7406;&#x901F;&#x5EA6;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x9700;&#x8981;&#x8FC7;&#x591A;&#x7684;&#x4E13;&#x4E1A;&#x77E5;&#x8BC6;&#x3002;</p>
<p>&#x4E8C;&#x54C8;&#x8BC6;&#x56FE;&#xFF08;HuskyLens&#xFF09;&#x5F3A;&#x8C03;&#x5B66;&#x4E60;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x901A;&#x8FC7;&#x5B66;&#x4E60;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x6BD4;&#x666E;&#x901A;&#x7684;&#x6A21;&#x578B;&#x7B97;&#x6CD5;&#x66F4;&#x597D;&#x5730;&#x9002;&#x5E94;&#x7528;&#x6237;&#x7684;&#x4F7F;&#x7528;&#x573A;&#x666F;&#x3002;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x6211;&#x4EEC;&#x7684;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x6B64;&#x7C7B;&#x4F20;&#x611F;&#x5668;&#x8BBE;&#x8BA1;&#x66F4;&#x597D;&#x7684;&#x7A0B;&#x5E8F;&#x6216;&#x8005;&#x9879;&#x76EE;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;
<img src="http://df.yirenliu.cn/Fj7py6ahNK06u2J7FTorC40zFZI2" alt=""></p>
<blockquote>
<p>&#x201C;&#x6211;&#x4EEC;&#x4E0E;&#x521B;&#x5BA2;&#x4EEC;&#x8FDB;&#x884C;&#x4E86;&#x5F88;&#x591A;&#x6B21;&#x4EA4;&#x6D41;&#xFF0C;&#x6765;&#x89E3;&#x4ED6;&#x4EEC;&#x7684;&#x9700;&#x6C42;&#x548C;&#x95EE;&#x9898;&#xFF0C;&#x8FD8;&#x548C;&#x4E4B;&#x524D;&#x4ECE;&#x4E8B;&#x8FC7;&#x7C7B;&#x4F3C;&#x9879;&#x76EE;&#x7684;&#x521B;&#x5BA2;&#x4EEC;&#x8FDB;&#x884C;&#x8BA8;&#x8BBA;&#xFF0C;&#x4E86;&#x89E3;&#x5F53;&#x524D;&#x673A;&#x5668;&#x89C6;&#x89C9;&#x6280;&#x672F;&#x7684;&#x5C40;&#x9650;&#x6027;&#x548C;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x201D;</p>
</blockquote>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x8FD9;&#x6837;&#x4E86;&#x89E3;&#x4E86;K210&#x82AF;&#x7247;&#x3002;</p>
<p>&#x56E2;&#x961F;&#x4E86;&#x89E3;&#x5230;&#x54EA;&#x4E9B;&#x529F;&#x80FD;&#x662F;&#x6700;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x3002;&#x4F8B;&#x5982;&#x4F20;&#x611F;&#x5668;&#x53EF;&#x4EE5;&#x50CF;PixyCam&#x6216;OpenMV&#x90A3;&#x6837;&#xFF0C;&#x628A;&#x4E09;&#x6216;&#x56DB;&#x4E2A;&#x529F;&#x80FD;&#x96C6;&#x6210;&#x5728;&#x4E00;&#x8D77;&#xFF1B;&#x4EE5;&#x53CA;&#x54EA;&#x4E9B;&#x90E8;&#x5206;&#x9700;&#x8981;&#x6539;&#x8FDB;&#xFF0C;&#x6BD4;&#x5982;&#x9700;&#x8981;&#x8003;&#x8651;&#x4F20;&#x611F;&#x5668;&#x8BBE;&#x7F6E;&#x7684;&#x51C6;&#x786E;&#x6027;&#x548C;&#x7B80;&#x4FBF;&#x6027;&#x3002;</p>
<p><img src="http://df.yirenliu.cn/FuyeuDZoIaB2vkbE7Jmco65GrjqT" alt=""></p>
<p>2019&#x5E74;7&#x6708;&#xFF0C;&#x6211;&#x4EEC;&#x6000;&#x7740;&#x6FC0;&#x52A8;&#x800C;&#x53C8;&#x5FD0;&#x5FD1;&#x7684;&#x5FC3;&#x60C5;&#xFF0C;&#x5728;&#x975E;&#x5E38;&#x6709;&#x540D;&#x7684;&#x7F51;&#x7AD9;Kickstarter&#x4E0A;&#x53D1;&#x8D77;&#x4E86;HuskyLens&#x7684;&#x4F17;&#x7B79;&#x3002;</p>
<p><img src="http://df.yirenliu.cn/FilONRbJIyrligMFBLRniVxlBRu8" alt=""></p>
<p>&#x60F3;&#x4E0D;&#x5230;&#xFF0C;HuskyLens&#x5728;&#x6D77;&#x5916;&#x83B7;&#x5F97;&#x4E86;&#x6781;&#x5927;&#x7684;&#x6B22;&#x8FCE;&#x3002;&#x77ED;&#x77ED;&#x4E00;&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5C31;&#x5B8C;&#x6210;&#x4E86;3&#x4E07;&#x7F8E;&#x5143;&#x7684;&#x4F17;&#x7B79;&#x76EE;&#x6807;&#xFF0C;&#x622A;&#x6B62;&#x5230;9&#x6708;8&#x65E5;&#x4F17;&#x7B79;&#x7ED3;&#x675F;&#xFF0C;&#x603B;&#x5171;&#x7B79;&#x96C6;&#x5230;12&#x4E07;&#x7F8E;&#x5143;&#xFF0C;&#x6709;1376&#x540D;&#x652F;&#x6301;&#x8005;&#x53C2;&#x4E0E;&#x4E86;&#x8FD9;&#x6B21;&#x4F17;&#x7B79;&#x6D3B;&#x52A8;&#x3002;
<img src="http://df.yirenliu.cn/FjtmEpUnoxPCT6X4tEkxBrYAQP7V" alt="">
<img src="http://df.yirenliu.cn/FkU2aXI8OjmPeXOS086p9qZt6YIW" alt=""></p>
<blockquote>
<p>HuskyLens&#x8BBE;&#x8BA1;&#x4E4B;&#x521D;&#xFF0C;&#x8003;&#x8651;&#x4E86;&#x521B;&#x5BA2;&#x4EEC;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x628A;&#x6700;&#x65B0;&#x7684;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x6280;&#x672F;&#x4E0E;&#x7D27;&#x51D1;&#x7684;&#x8BBE;&#x8BA1;&#x548C;&#x6027;&#x80FD;&#x6781;&#x4F73;&#x7684;&#x5904;&#x7406;&#x5668;&#x76F8;&#x7ED3;&#x5408;&#xFF0C;&#x53EA;&#x6709;&#x4F60;&#x60F3;&#x4E0D;&#x5230;&#xFF0C;&#x6CA1;&#x6709;&#x5B83;&#x505A;&#x4E0D;&#x5230;&#x3002;</p>
</blockquote>
<p>Rockets&#x4E4B;&#x524D;&#x63D0;&#x5230;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x521B;&#x5BA2;&#x4F1A;&#x5458;&#x4EEC;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x70ED;&#x60C5;&#x7684;&#x6D4B;&#x8BD5;&#x4EBA;&#x5458;&#x3002;&#x4ED6;&#x4EEC;&#x7684;&#x4F7F;&#x7528;&#x53CD;&#x9988;&#x6709;&#x65F6;&#x5F88;&#x6BD2;&#x820C;&#xFF0C;&#x4F46;&#x90FD;&#x8BF4;&#xFF0C;&#x826F;&#x836F;&#x82E6;&#x53E3;&#x5229;&#x4E8E;&#x75C5;&#xFF0C;&#x6700;&#x5927;&#x7684;&#x95EE;&#x9898;&#x662F;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x6700;&#x7CDF;&#x7CD5;&#x7684;&#x53CD;&#x9988;&#x662F;&#x6CA1;&#x6709;&#x53CD;&#x9988;&#x3002;&#x201D;&#x5C16;&#x9510;&#x800C;&#x53C8;&#x82DB;&#x523B;&#xFF0C;&#x5F00;&#x653E;&#x800C;&#x6709;&#x5EFA;&#x8BBE;&#x6027;&#x7684;&#x5BF9;&#x8BDD;&#xFF0C;&#x624D;&#x6709;&#x52A9;&#x4E8E;&#x6253;&#x9020;&#x51FA;&#x66F4;&#x5F3A;&#x5927;&#x7684;&#x4EA7;&#x54C1;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x4E5F;&#x8BF7;&#x5927;&#x5BB6;&#x79EF;&#x6781;&#x53CD;&#x9988;&#x4E8C;&#x54C8;&#x8BC6;&#x56FE;&#xFF08;HuskyLens&#xFF09;&#x7684;&#x4F7F;&#x7528;&#x60C5;&#x51B5;&#xFF0C;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x7684;&#x4E8C;&#x54C8;&#x53D8;&#x5F97;&#x66F4;&#x806A;&#x660E;&#x3002;</p>
<p>&#x8F66;&#x5E93;&#x6587;&#x5316;&#x7684;&#x672C;&#x8D28;&#x662F;&#x521B;&#x9020;&#x548C;&#x521B;&#x65B0;&#xFF0C;&#x4EE5;&#x53CA;&#x5BF9;&#x672A;&#x77E5;&#x4E16;&#x754C;&#x7684;&#x597D;&#x5947;&#x548C;&#x6E34;&#x671B;&#xFF0C;&#x8611;&#x83C7;&#x4E91;&#x521B;&#x5BA2;&#x7A7A;&#x95F4;&#x4E5F;&#x662F;&#x8FD9;&#x6837;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x6838;&#x5FC3;&#x7CBE;&#x795E;&#xFF1A;&#x7528;&#x52AA;&#x529B;&#x8D62;&#x5F97;&#x6210;&#x529F;&#x3002;</p>
<p>DFRobot&#x7EE7;&#x627F;&#x4E86;&#x8F66;&#x5E93;&#x6587;&#x5316;&#x7684;&#x56E0;&#x7D20;&#xFF0C;&#x6709;&#x521B;&#x65B0;&#x7CBE;&#x795E;&#xFF0C;&#x6709;&#x56E2;&#x961F;&#x7CBE;&#x795E;&#xFF0C;&#x52AA;&#x529B;&#x62FC;&#x640F;&#x7CBE;&#x795E;&#x3002;&#x4E5F;&#x6B63;&#x662F;&#x5BF9;&#x6210;&#x529F;&#x7684;&#x6E34;&#x671B;&#x4EE5;&#x53CA;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x597D;&#x5947;&#x548C;&#x60F3;&#x6CD5;&#x7684;&#x5B9E;&#x73B0;&#x80FD;&#x529B;&#xFF0C;&#x624D;&#x6709;&#x4E86;&#x4ECA;&#x5929;&#x7684;DF&#x521B;&#x5BA2;&#x793E;&#x533A;&#x548C;&#x53EF;&#x7231;&#x7684;&#x4F60;&#x4EEC;&#x3002;</p>
<pre><code class="lang-html">&#x4F5C;&#x8005;: DF&#x521B;&#x5BA2;&#x793E;&#x533A;
&#x94FE;&#x63A5;: https://mc.dfrobot.com.cn/&#x4E8C;&#x54C8;&#x8BC6;&#x56FE;&#x54C1;&#x724C;.MD
&#x6765;&#x6E90;: DF&#x521B;&#x5BA2;&#x793E;&#x533A;
&#x672C;&#x6587;&#x539F;&#x521B;&#x53D1;&#x5E03;&#x4E8E;&#x300C;DF&#x521B;&#x5BA2;&#x793E;&#x533A;&#x300D;,&#x8F6C;&#x8F7D;&#x8BF7;&#x6CE8;&#x660E;&#x51FA;&#x5904;,&#x8C22;&#x8C22;&#x5408;&#x4F5C;!
</code></pre>
<p><img src="https://mc.dfrobot.com.cn/template/zhanzhuai_v/images/logo.png" alt="https://mc.dfrobot.com.cn/template/zhanzhuai_v/images/logo.png"></p>

                </div>
                <script src="https://my.openwrite.cn/js/readmore.js"></script>
                <script>
                    var enablePlugin = false;
                    var allowDomain = "localhost";
                    if(allowDomain){
                        var currentDomain = location.hostname;
                        if ($.isArray(allowDomain)) {
                            $.each(allowDomain, function(index, item) {
                                if (currentDomain == item) {
                                    enablePlugin = true;
                                    return false;
                                }
                            });
                        }else{
                           if (currentDomain == allowDomain) {
                                enablePlugin = true;
                            }
                        }
                    }else{
                        enablePlugin = true;
                    }
                    
                    if(enablePlugin){
                        var isMobile = navigator.userAgent.match(/(phone|pad|pod|iPhone|iPod|ios|iPad|Android|Mobile|BlackBerry|IEMobile|MQQBrowser|JUC|Fennec|wOSBrowser|BrowserNG|WebOS|Symbian|Windows Phone)/i);
                        if (!isMobile) {
                            var btw = new BTWPlugin();
                            btw.init({"allowDomain":"localhost","blogId":"21047-1585724546375-833","name":"DF创客社区","qrcode":"http://df.yirenliu.cn/FrbGVMroj_tBa1OR9EcyPBzJ3ba_","keyword":"VIP","id":"vip-container"});
                        }
                    }
                </script>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev navigation-unique" aria-label="Previous page: Introduction">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"二哈识图","level":"1.2","depth":1,"previous":{"title":"Introduction","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["donate","github-buttons@2.1.0","edit-link","copyright","readmore","livereload"],"root":".","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"copyright":{"copyProtect":true,"site":"https://mc.dfrobot.com.cn/","author":"DF创客社区","website":"DF创客社区","image":"https://mc.dfrobot.com.cn/template/zhanzhuai_v/images/logo.png"},"search":{},"readmore":{"allowDomain":"localhost","blogId":"21047-1585724546375-833","name":"DF创客社区","qrcode":"http://df.yirenliu.cn/FrbGVMroj_tBa1OR9EcyPBzJ3ba_","keyword":"VIP"},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"donate":{"alipay":"https://sphard.com/images/alipay.jpg","alipayText":"支付宝打赏","button":"打赏","title":"","wechat":"https://sphard.com/images/wechatpay.jpg","wechatText":"微信打赏"},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"github-buttons":{"repo":"darrenliuwei/gitbook","types":["star"],"size":"small"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":"Edit This Page","base":"https://github.com/darrenliuwei/gitbook/edit/master"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"sphard","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"编写gitbook电子书教程","language":"zh-hans","gitbook":"*","description":"gitbook电子书教程"},"file":{"path":"二哈识图品牌.MD","mtime":"2020-04-01T07:27:12.382Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-04-01T07:31:31.764Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-donate/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-copyright/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

